<?php
 $_GET["keyword"]="select";

//  $_GET["id_repair"]="1";

  include_once("../model/repair.php ");
$jsonobj =$json;
define('SUPON','../imagesystem/yes.png'); 
define('SUPOFF','../imagesystem/no.png'); 
 
 
$obj = json_decode($jsonobj);
print_r($obj->data );
// echo $obj->id_hardware;

$หน่วยงาน =$obj->data->re_agency;
$หมายเลข =$obj->data->re_serial_number;
$อาการ =$obj->data->re_breakdown;
$การดำเนินการ =$obj->data->re_operation;
$ครุภัณฑ์ =$obj->data->re_type;
$ยี่ห้อ =$obj->data->re_model;
$วันที่แจ้ง =$obj->data->re_date_received;

$ภายนอก = ($obj->data->re_sendreport==1 ? SUPON :  SUPOFF );
$คืน = ($obj->data->re_sendreturn==1 ? SUPON :  SUPOFF );
// $ภายนอก =$obj->data->re_sendreport;
// $คืน =$obj->data->re_sendreturn;
$อื่น =SUPOFF;
// var_dump(json_decode($jsonobj));
//  die();
 header('Content-Type: text/html; charset=utf-8');
 require_once("../plugin/fpdf/fpdf.php");
//  file_put_contents("file.txt", "hello");
 $pdf = new FPDF('P','mm','A4');
 $pdf->AddPage();
 $pdf->AddFont('THSarabun','','TH Sarabun.php');//ธรรมดา
 $pdf->AddFont('THSarabun','b','THSarabun Bold.php');//ธรรมดา
 
 $payle = "__";
 $a = 0;
 $pass=10;
 $paytop = "|";
//  for($mm= $pass;$mm<=10000;$mm=$mm+$pass)
//  {
//     $pdf->SetFont('THSarabun','',16);
//     $pdf->text(4,$mm, iconv( 'UTF-8','cp874' , $a   ) );//1
//         $pdf->SetFont('THSarabun','',16);
//     $pdf->text(6,$mm, iconv( 'UTF-8','cp874' , $payle  ) );//1
//     $pdf->text(5,$a, iconv( 'UTF-8','cp874' , $payle  ) );
//     $a = $a+1;
//  }
//  $a = 0;

//  for($mm= $pass;$mm<=10000;$mm=$mm+$pass)
//  {
//     $pdf->SetFont('THSarabun','',16);
//     $pdf->text(200,$mm, iconv( 'UTF-8','cp874' , $a   ) );//1
//         $pdf->SetFont('THSarabun','',16);
//     $pdf->text(204,$mm, iconv( 'UTF-8','cp874' , $payle  ) );//1
//     $pdf->text(205,$a, iconv( 'UTF-8','cp874' , $payle  ) );
//     $a = $a+1;
//  }
//  $a = 0;
//  for($mm= $pass;$mm<=10000;$mm=$mm+$pass)
//  {
//     $pdf->SetFont('THSarabun','',16);
//     $pdf->text($mm,10, iconv( 'UTF-8','cp874' , $a   ) );//1
//         $pdf->SetFont('THSarabun','',16);
//     $pdf->text($mm,12, iconv( 'UTF-8','cp874' , $paytop  ) );//1
//     $pdf->text($a,11, iconv( 'UTF-8','cp874' , $paytop  ) );

//     $a = $a+1;
//  }

//  $a = 0;
//  for($mm= $pass;$mm<=10000;$mm=$mm+$pass)
//  {
//     $pdf->SetFont('THSarabun','',16);
//     $pdf->text($mm,290, iconv( 'UTF-8','cp874' , $a   ) );//1
//         $pdf->SetFont('THSarabun','',16);
//     $pdf->text($mm,292, iconv( 'UTF-8','cp874' , $paytop  ) );//1
//     $pdf->text($a,293, iconv( 'UTF-8','cp874' , $paytop  ) );
//     $a = $a+1;
//  }
$pdf->Image('binary-codes.png',0,0,15);
$pdf->SetFillColor(128,128,128);
 $pdf->Rect(149.5   ,9.5 ,  44 , 24.5, "F");
 $pdf->SetFont('THSarabun','',14);
 $pdf->text(153   ,21 , iconv( 'UTF-8','cp874' , 'พัสดุลงรับเลขที่....................'  ) );//1
 $pdf->text(153   ,28 , iconv( 'UTF-8','cp874' , 'วันที่......................................'  ) );//1




$pdf->SetLineWidth(0.1); $pdf->Rect(26   ,42 , 169,59.5, "D");


$pdf->Rect(26   ,101.5 , 169 , 30, "D");
$pdf->Rect(26   ,131.5 ,  85 , 83.5, "D");
// $pdf->Rect(111   ,131.5 ,  84 , 83.5, "D");
$pdf->Rect(111   ,131.5 ,  84 , 83.5+59, "D");

$pdf->Rect(26   ,215 ,  85 , 59, "D");
// $pdf->Rect(111   ,215 ,  84 , 59, "D");
 
 $pdf->SetFont('THSarabun','b',22);
     $pdf->text(34.5  ,21 , iconv( 'UTF-8','cp874' , 'ใบแจ้งซ่อม/รายงานการซ่อม/เบิกอะไหล่'  ) );//1
    $pdf->SetFont('THSarabun','',15);
    $pdf->text(34.5   ,31 , iconv( 'UTF-8','cp874' , '(ครุภัณฑ์คอมพิวเตอร์และอุปกรณ์คอมพิวเตอร์)'  ) );//1
    $pdf->text(34.5   ,38 , iconv( 'UTF-8','cp874' , 'โรงพยาบาลพระนารายณ์มหาราช  โทรศัพท์(036) 785444 ต่อ 4530'  ) );//1
    $pdf->SetFont('THSarabun','U',15);
    $pdf->text(28   ,48 , iconv( 'UTF-8','cp874' , 'ข้อมูลส่งซ่อม ' ) );//1
    $pdf->SetFont('THSarabun','',15);
    $pdf->text(28   ,54 , iconv( 'UTF-8','cp874' , 'วันที่แจ้งซ่อม........................................................' ) );//1
    $pdf->text(50   ,54 , iconv( 'UTF-8','cp874' , $วันที่แจ้ง ) );//1
    
    
    
    $pdf->text(28   ,61 , iconv( 'UTF-8','cp874' , 'ครุภัณฑ์................................................................' ) );//1
        $pdf->text(50   ,61 , iconv( 'UTF-8','cp874' , $ครุภัณฑ์ ) );//1
    
    $pdf->text(28   ,68 , iconv( 'UTF-8','cp874' ,'ยี่ห้อ/รุ่น................................................................' ) );//1
    $pdf->text(50   ,68 , iconv( 'UTF-8','cp874' , $ยี่ห้อ ) );//1
    $pdf->text(28   ,75 , iconv( 'UTF-8','cp874' ,'วันที่ได้รับ..............................................................' ) );//1
    $pdf->text(50   ,75 , iconv( 'UTF-8','cp874' , $วันที่แจ้ง ) );//1
    $pdf->text(28   ,82 , iconv( 'UTF-8','cp874' ,'อาการ/สาเหตุ.........................................................................................................................................................................' ) );//1
    $pdf->text(50   ,82 , iconv( 'UTF-8','cp874' ,$อาการ ) );//1

// end s-t start e-t
 
$pdf->SetFont('THSarabun','',15);
 
 
$pdf->text(99.5   ,48 , iconv( 'UTF-8','cp874' , 'เลขที่ส่งซ่อม........................................................................................' ) );//1
$pdf->text(120   ,48 , iconv( 'UTF-8','cp874' , '-' ) );//1

$pdf->text(99.5   ,54 , iconv( 'UTF-8','cp874' , 'หน่วยงาน............................................................................................' ) );//1
$pdf->text(120   ,54 , iconv( 'UTF-8','cp874' , $หน่วยงาน ) );//1
$pdf->text(99.5   ,61 , iconv( 'UTF-8','cp874' , 'หมายเลข 7440-001-0001................................................................' ) );//1
$pdf->text(140   ,61 , iconv( 'UTF-8','cp874' , $หมายเลข ) );//1

$pdf->text(99.5   ,68 , iconv( 'UTF-8','cp874' ,'IP.........................................................................................................' ) );//1
$pdf->text(99.5   ,75 , iconv( 'UTF-8','cp874' ,'ราคา....................................................................................................' ) );//1
// $pdf->text(99.5   ,82 , iconv( 'UTF-8','cp874' ,'ราคา' ) );//1
$pdf->text(99.5   ,90 , iconv( 'UTF-8','cp874' ,'ผู้แจ้งซ่อม.............................................................................................') );//1
$pdf->text(115   ,96 , iconv( 'UTF-8','cp874' ,'วันที่...................................................................................' ) );//1
      // end e-t start s-c
      $pdf->SetFont('THSarabun','U',15);
 $pdf->text(28,108  , iconv( 'UTF-8','cp874' , 'การดำเนินการ'  ) );//1
 $pdf->SetFont('THSarabun','',15);
 $sss = $การดำเนินการ;
 
 $aaa = strlen( $sss);
 $text[0]=mb_substr( $sss, 0 ,80);

 $text[1]=mb_substr( $sss, 80,90 );
 
$orvertext=mb_substr( $sss, 80+90  );
$orver = strlen($orvertext);
//  $text[2]=substr( $sss, 75+75 ,75);
 $pdf->text(50 ,108  , iconv( 'UTF-8','cp874' , $text[0]  ) );//1
 if($orver !=0){
 
  $pdf->text(28,114 , iconv( 'UTF-8','cp874' , $text[1]."###$orver!"  ) );//1
  
 }else{
    $pdf->text(28,114 , iconv( 'UTF-8','cp874' , $text[1]  ) );//1
 }

//  $pdf->text(50,120  , iconv( 'UTF-8','cp874' , $text[2] ) );//1

 
 $pdf->text(48,108  , iconv( 'UTF-8','cp874' , '.........................................................................................................................................................................'  ) );//1
 $pdf->text(28,114  , iconv( 'UTF-8','cp874' , '................................................................................................................................................................................................'  ) );//1
 $pdf->SetFont('THSarabun','',13);


 $pdf->Image($ภายนอก,100,117 ,3);
 $pdf->Image($คืน,123.5,117 ,3);
 $pdf->Image($อื่น,136 ,117 ,3);
 $pdf->text(28,120  , iconv( 'UTF-8','cp874' , 'เบิกวัสดุ/อะไหล่.......................................................................    ส่งซ่อมภายนอก    ส่งคืน      อื่นๆ..............................................................'  ) );// 
 $pdf->text(115,120+5 , iconv( 'UTF-8','cp874' , 'ลงชื่อช่างคอมพิวเตอร์ ................................................................' ) );
 $pdf->text(135 ,120+5+5 , iconv( 'UTF-8','cp874' , 'วันที่ ................................................................' ) );
//  $pdf->text(140 ,117+7+7 , iconv( 'UTF-8','cp874' , '(นายแพทย์....)' ) );
//  $pdf->text(140 ,117+7+7+7 , iconv( 'UTF-8','cp874' , '(นายแพทย์....)' ) );
 $pdf->SetFont('THSarabun','',15);
 $pdf->text(28,140  , iconv( 'UTF-8','cp874' , 'ความเห็นของผู้ตรวจสอบช่างคอมพิวเตอร์'  ) );  
 $pdf->text(28 ,147  , iconv( 'UTF-8','cp874' , '..............................................................................................'  ) );
 $pdf->text(28 ,154  , iconv( 'UTF-8','cp874' , '..............................................................................................'  ) );
 
 $pdf->text(99.5-40 ,161  , iconv( 'UTF-8','cp874' , 'ลงชื่อ.................................................'  ) );
 $pdf->text(99.5-40 ,168  , iconv( 'UTF-8','cp874' ,  'วันที่.................................................'  ) );
 $pdf->text(28 ,168+7 , iconv( 'UTF-8','cp874' , 'ความเห็นของหัวหน้าศูนย์คอมพิวเตอร์'  ) );
 $pdf->text(28 ,187 , iconv( 'UTF-8','cp874' , '...............................................................................................'  ) );
 $pdf->text(99.5-40 ,187+7  , iconv( 'UTF-8','cp874' , 'ลงชื่อ.................................................'  ) );
 // end e-t start s-c
 $pdf->SetFont('THSarabun','',14);
  $pdf->text(115 ,140  , iconv( 'UTF-8','cp874' , 'ความเห็นของผู้ช่วยผู้อำนวยการด้านเทคโนโลยีและสารสนเทศ'  ) );

  $pdf->text(115 ,147  , iconv( 'UTF-8','cp874' , '(CIO)'  ) );
  $pdf->SetFont('THSarabun','',15);
  $pdf->text(115 ,154  , iconv( 'UTF-8','cp874' , '........................................................................................'  ) );
  $pdf->text(115 ,161  , iconv( 'UTF-8','cp874' , '........................................................................................'  ) );
  $pdf->text(115 ,168  , iconv( 'UTF-8','cp874' , '........................................................................................'  ) );
  $pdf->text(133 ,182 , iconv( 'UTF-8','cp874' , 'ลงชื่อ.................................................' ) );
  $pdf->text(140 ,187 , iconv( 'UTF-8','cp874' , '(นายแพทย์สุรัตน์  ผิวสว่าง)' ) );
  $pdf->text(140 ,187+7 , iconv( 'UTF-8','cp874' , 'ตำแหน่งนายเพทย์ชำนาญการ' ) );
  $pdf->text(140 ,203 , iconv( 'UTF-8','cp874' , 'วันที่..........................................' ) );

  $pdf->text(115,226 , iconv( 'UTF-8','cp874' , 'งานพัสดุ :จัดซื้ออุปกรณ์ให้ศูนย์คอมแล้ว' ) );
  $pdf->text(115,233 , iconv( 'UTF-8','cp874' ,  'วันที่.................................................................................' ) );
  $pdf->text(115, 240, iconv( 'UTF-8','cp874' ,  'ราคา................................................................................' ) );
  $pdf->text(115, 247, iconv( 'UTF-8','cp874' ,  'ลงชื่อ.................................................................................' ) );
  $pdf->text(115, 254    , iconv( 'UTF-8','cp874' , 'ศูนย์คอม : รับอุปกรณ์แล้ว'  ) );
  $pdf->text(115, 261   , iconv( 'UTF-8','cp874','ลงชื่อ.............................ลงวันที่.................................'   ) );
  // end  s-c start s-b
$pdf->text(28,223 , iconv( 'UTF-8','cp874' ,'ความเห็นหัวหน้ากลุ่มงานสารสนเทศทางการแพทย์' ) );
$pdf->text(28, 230, iconv( 'UTF-8','cp874' ,  '........................................................................................'  ) );
$pdf->text(28,237 , iconv( 'UTF-8','cp874' ,  '........................................................................................'  ) );
$pdf->text(28,244    , iconv( 'UTF-8','cp874' , '........................................................................................'  ) );
$pdf->text(99.5-40,244+7    , iconv( 'UTF-8','cp874' , 'ลงชื่อ..........................................'  ) );
$pdf->text(99.5-40,244+7+7   , iconv( 'UTF-8','cp874' ,  'วันที่.................................................'  ) );
    // end  s-b start e-b
  $pdf->Output('F','pdf');

  //  include("basepdf/MAR.pdf");
   
  
  //   header('Content-type: application/pdf');
  // header('Content-Transfer-Encoding: binary');
  // header('Accept-Ranges: bytes');
   
  // die();
  echo ' <embed src="pdf" width="100%" height="100%" />';
?>